app/controllers/events_controller.rb

  def create
    time_array = params[:duration].split(":").map(&:to_i)
    time_ = time_array[0] * 60 + time_array[1]

    event_ = Event.new(
      start_date: params[:start_date],
      duration: time_,
      title: params[:title],
      description: params[:description],
      price: params[:price].to_i,
      location: params[:location],
      administrator: current_user
    )

    if event_.valid?
      event_.save
---
INSERT INTO "events" ("start_date", "duration", "title", "description", "price", "location", "administrator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def show
    @event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    @event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]