app/controllers/static_pages_controller.rb

SELECT "events".* FROM "events"
---
  def index
    @events = Event.all