app/controllers/users_controller.rb

  def profile_holder?
    id_ = params[:id]
    unless (!current_user.nil? && (current_user == User.find(id_)))
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 11], ["LIMIT", 1]]